## 1.1 Filter and Select data

* use `pandas`  

### Indexing in pandas 

* **index** list of int/labels to uniquely id rows/cols   
* done with either  
    * square brackets `[..]` 
    * `.ix[]` indexer  
    
### code demo

In [1]:
import numpy as np, pandas as pd
from pandas import Series, DataFrame

In [2]:
series_obj = Series(np.arange(8), index=['row1 row2 row3 row4 row5 row6 row7 row8'.split()])
series_obj

row1    0
row2    1
row3    2
row4    3
row5    4
row6    5
row7    6
row8    7
dtype: int32

#### label index

In [4]:
series_obj['row7']

6

#### integer index

In [6]:
series_obj.ix[[0,7]]

row1    0
row8    7
dtype: int32

In [8]:
np.random.seed(25)
df_obj = DataFrame(np.random.rand(36).reshape((6,6)), index='row1 row2 row3 row4 row5 row6'.split(), columns='col1 col2 col3 col4 col5 col6'.split())
df_obj

          col1      col2      col3      col4      col5      col6
row1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [10]:
df_obj.ix[['row2', 'row5'], ['col5', 'col2']]

          col5      col2
row2  0.402366  0.437611
row5  0.421004  0.559053

### data slicing

In [11]:
# [starting label index : ending label index]
series_obj['row3':'row7']

row3    2
row4    3
row5    4
row6    5
row7    6
dtype: int32

### comparing with scalars

In [12]:
df_obj < .2

       col1   col2   col3   col4   col5   col6
row1  False  False  False   True  False   True
row2  False  False  False  False  False   True
row3  False  False   True  False  False  False
row4  False  False  False  False  False  False
row5  False  False   True  False  False  False
row6  False  False  False  False  False  False

### filtering with scalars

In [13]:
series_obj[series_obj > 6]

row8    7
dtype: int32

### setting values with scalars

In [15]:
series_obj['row1', 'row5', 'row8'] = 8
series_obj

row1    8
row2    1
row3    2
row4    3
row5    8
row6    5
row7    6
row8    8
dtype: int32

## 1.2 Missing values in python

* by default, missing values are `NaN`

#### will look at:
1. discovering what is missing
2. filling in for missing values  
3. counting missing values  
4. filter out missing values

### figuring out what is missing

In [16]:
missing = np.nan
rows = ['row1', 'row2', missing, 'row4', 'row5', 'row6', missing, 'row8']
series_obj = Series(rows)
series_obj

0    row1
1    row2
2     NaN
3    row4
4    row5
5    row6
6     NaN
7    row8
dtype: object

#### `.isnull()`

In [17]:
series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
dtype: bool

### fill in missing values

In [27]:
np.random.seed(25)
df_obj = DataFrame(np.random.randn(36).reshape((6,6)))
df_obj

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734 -0.232312
2  2.152957 -1.334661  0.076380 -1.246089  1.202272 -1.049942
3  1.056610 -0.419678  2.294842 -2.594487  2.822756  0.680889
4 -1.577693 -1.976254  0.533340 -0.290870 -0.513520  1.982626
5  0.226001 -1.839905  1.607671  0.388292  0.399732  0.405477

In [28]:
df_obj.ix[3:5, 0] = missing
df_obj.ix[1:4, 5] = missing
df_obj

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734       NaN
2  2.152957 -1.334661  0.076380 -1.246089  1.202272       NaN
3       NaN -0.419678  2.294842 -2.594487  2.822756       NaN
4       NaN -1.976254  0.533340 -0.290870 -0.513520       NaN
5       NaN -1.839905  1.607671  0.388292  0.399732  0.405477

#### `.fillna()`

In [29]:
filled_df = df_obj.fillna(0)
filled_df

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734  0.000000
2  2.152957 -1.334661  0.076380 -1.246089  1.202272  0.000000
3  0.000000 -0.419678  2.294842 -2.594487  2.822756  0.000000
4  0.000000 -1.976254  0.533340 -0.290870 -0.513520  0.000000
5  0.000000 -1.839905  1.607671  0.388292  0.399732  0.405477

In [30]:
#pass a dict -- eg fill different numbers for different columns
filled_df = df_obj.fillna({0: 0.1, 5:1.25})
filled_df

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734  1.250000
2  2.152957 -1.334661  0.076380 -1.246089  1.202272  1.250000
3  0.100000 -0.419678  2.294842 -2.594487  2.822756  1.250000
4  0.100000 -1.976254  0.533340 -0.290870 -0.513520  1.250000
5  0.100000 -1.839905  1.607671  0.388292  0.399732  0.405477

#### `'ffill'` - fill forward

* if there is a missing value, it is filled in with the value directly above

In [31]:
fill_df = df_obj.fillna(method='ffill')
fill_df

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734 -0.222326
2  2.152957 -1.334661  0.076380 -1.246089  1.202272 -0.222326
3  2.152957 -0.419678  2.294842 -2.594487  2.822756 -0.222326
4  2.152957 -1.976254  0.533340 -0.290870 -0.513520 -0.222326
5  2.152957 -1.839905  1.607671  0.388292  0.399732  0.405477

### count missing values

* eg which variables have most missings?

In [34]:
df_obj

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734       NaN
2  2.152957 -1.334661  0.076380 -1.246089  1.202272       NaN
3       NaN -0.419678  2.294842 -2.594487  2.822756       NaN
4       NaN -1.976254  0.533340 -0.290870 -0.513520       NaN
5       NaN -1.839905  1.607671  0.388292  0.399732  0.405477

In [35]:
df_obj.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

### filtering out missing values

In [39]:
# drops every row that has any missing values
df_no_nan = df_obj.dropna()
df_no_nan

          0        1         2         3         4         5
0  0.228273  1.02689 -0.839585 -0.591182 -0.956888 -0.222326

In [38]:
# pass axis = 1 to do this for columns
df_obj.dropna(axis=1)

          1         2         3         4
0  1.026890 -0.839585 -0.591182 -0.956888
1  1.837905 -2.053231  0.868583 -0.920734
2 -1.334661  0.076380 -1.246089  1.202272
3 -0.419678  2.294842 -2.594487  2.822756
4 -1.976254  0.533340 -0.290870 -0.513520
5 -1.839905  1.607671  0.388292  0.399732

In [40]:
# only drops rows that have ALL missing values
df_obj.dropna(how='all')

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734       NaN
2  2.152957 -1.334661  0.076380 -1.246089  1.202272       NaN
3       NaN -0.419678  2.294842 -2.594487  2.822756       NaN
4       NaN -1.976254  0.533340 -0.290870 -0.513520       NaN
5       NaN -1.839905  1.607671  0.388292  0.399732  0.405477

## 1.3 Remove duplicates

In [41]:
import numpy as np, pandas as pd
from pandas import Series, DataFrame

In [43]:
# df with duplicated rows
df_obj = DataFrame({'col1':[1,1,2,2,3,3,3], 'col2':'a a b b c c c'.split(), 'col3':'A A B B C C C'.split()})
df_obj

   col1 col2 col3
0     1    a    A
1     1    a    A
2     2    b    B
3     2    b    B
4     3    c    C
5     3    c    C
6     3    c    C

#### `df.duplicated()`

In [46]:
df_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

#### `df.drop_duplicates()`

In [48]:
df_obj.drop_duplicates()

   col1 col2 col3
0     1    a    A
2     2    b    B
4     3    c    C

#### do the same for columns

In [49]:
df_obj = DataFrame({'col1':[1,1,2,2,3,3,3], 'col2':'a a b b c c c'.split(), 'col3':'A A B B C C C'.split()})
df_obj.drop_duplicates(['col3'])

   col1 col2 col3
0     1    a    A
2     2    b    B
4     3    c    C

## 1.4 Concatenate and transform data

* **concatenate** - combining data from different sources  
* **transform** - change the data to suit your needs

In [50]:
import numpy as np, pandas as pd

In [51]:
df_obj = pd.DataFrame(np.arange(36).reshape((6,6)))
df_obj

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [52]:
df_obj2 = pd.DataFrame(np.arange(15).reshape((5,3)))
df_obj2

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

### concatenate data

In [55]:
# join on row values - AXIS = 1
pd.concat([df_obj, df_obj2], axis=1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [56]:
# join on col values -- NO AXIS
pd.concat([df_obj, df_obj2])

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

### dropping data

In [57]:
# drop rows with index 0, 2
df_obj.drop([0,2])

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [58]:
# drop columns with index 0, 2 -- uses AXIS
df_obj.drop([0,2], axis=1)

    1   3   4   5
0   1   3   4   5
1   7   9  10  11
2  13  15  16  17
3  19  21  22  23
4  25  27  28  29
5  31  33  34  35

### adding data

In [59]:
series_obj = pd.Series(np.arange(6))
series_obj.name = 'added_var'
series_obj

0    0
1    1
2    2
3    3
4    4
5    5
Name: added_var, dtype: int32

#### `df.join()`

In [60]:
var_added = pd.DataFrame.join(df_obj, series_obj)
var_added

    0   1   2   3   4   5  added_var
0   0   1   2   3   4   5          0
1   6   7   8   9  10  11          1
2  12  13  14  15  16  17          2
3  18  19  20  21  22  23          3
4  24  25  26  27  28  29          4
5  30  31  32  33  34  35          5

#### `df.append()`

* use `ignore_index=True` if want `pandas` to re-index data

In [64]:
added_datatable = var_added.append(var_added, ignore_index=False)
added_datatable

    0   1   2   3   4   5  added_var
0   0   1   2   3   4   5          0
1   6   7   8   9  10  11          1
2  12  13  14  15  16  17          2
3  18  19  20  21  22  23          3
4  24  25  26  27  28  29          4
5  30  31  32  33  34  35          5
0   0   1   2   3   4   5          0
1   6   7   8   9  10  11          1
2  12  13  14  15  16  17          2
3  18  19  20  21  22  23          3
4  24  25  26  27  28  29          4
5  30  31  32  33  34  35          5

In [65]:
added_datatable = var_added.append(var_added, ignore_index=True)
added_datatable

     0   1   2   3   4   5  added_var
0    0   1   2   3   4   5          0
1    6   7   8   9  10  11          1
2   12  13  14  15  16  17          2
3   18  19  20  21  22  23          3
4   24  25  26  27  28  29          4
5   30  31  32  33  34  35          5
6    0   1   2   3   4   5          0
7    6   7   8   9  10  11          1
8   12  13  14  15  16  17          2
9   18  19  20  21  22  23          3
10  24  25  26  27  28  29          4
11  30  31  32  33  34  35          5

### sorting data

In [68]:
df_sorted = df_obj.sort_values(by=[5], ascending=[False])
df_sorted

    0   1   2   3   4   5
5  30  31  32  33  34  35
4  24  25  26  27  28  29
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

## 1.5 Group and aggregate data

* compare subsets  
* only want specific subsets

In [69]:
import numpy as np, pandas as pd

In [70]:
address = "./Ch01/01_05/mtcars.csv"
cars = pd.read_csv(address)
cars.columns = 'car_names mpg cyl disp hp drat wt qsec vs am gear carb'.split()
cars.head()

,car_names,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

### group by number of `cyl`

In [72]:
cars_groups = cars.groupby('cyl')
cars_groups.mean()

,mpg,disp,hp,drat,wt,qsec,vs,am,gear,carb
cyl,,,,,,,,,,
4,26.663636,105.136364,82.636364,4.070909,2.285727,19.137273,0.909091,0.727273,4.090909,1.545455
6,19.742857,183.314286,122.285714,3.585714,3.117143,17.977143,0.571429,0.428571,3.857143,3.428571
8,15.100000,353.100000,209.214286,3.229286,3.999214,16.772143,0.000000,0.142857,3.285714,3.500000